html/docker/kubernates-handbook/theory/controller/job.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Job</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="replica_set.html"> UP </a>
 |
 <a accesskey="H" href="controller.html"> HOME </a>
</div><div id="content">
<h1 class="title">Job</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8672d6c">Spec格式</a></li>
<li><a href="#orgb24f894">Bare Pods</a></li>
</ul>
</div>
</div>
<p>
Job负责 <span class="underline">批处理任务</span> ，即仅执行一次的任务，它保证批处理任务的一个或多个Pod成功结束 
</p>
<div id="outline-container-org8672d6c" class="outline-2">
<h2 id="org8672d6c">Spec格式</h2>
<div class="outline-text-2" id="text-org8672d6c">
<ul class="org-ul">
<li><span class="underline">spec.template</span> 格式与 Pod 相同</li>
<li><span class="underline">RestartPolicy</span> 仅支持 <span class="underline">Never</span> 或 <span class="underline">OnFailure</span></li>
<li>单个Pod时，默认Pod成功运行后Job即结束</li>
<li><span class="underline">.spec.completions</span> 标志 <b>Job结束需要成功运行的Pod个数</b> ，默认为 <span class="underline">1</span></li>
<li><span class="underline">.spec.parallelism</span> 标志 <b>并行运行的Pod的个数</b> ，默认为 <span class="underline">1</span></li>
<li><span class="underline">spec.activeDeadlineSeconds</span> 标志 <b>失败Pod的重试最大时间</b> ，超过这个时间不会继续重试</li>
</ul>

<p>
一个简单的例子：
</p>

<pre class="example" id="org27a4984">
apiVersion: batch/v1
kind: Job
metadata:
  name: pi
spec:
  template:
    metadata:
      name: pi
    spec:
      containers:
      - name: pi
	image: perl
	command: ["perl",  "-Mbignum=bpi", "-wle", "print bpi(2000)"]
      restartPolicy: Never
</pre>

<div class="org-src-container">
<pre class="src src-sh">$ kubectl create -f ./job.yaml
job <span style="color: #deb887;">"pi"</span> created
$ <span style="color: #4eee94;">pods</span>=$(kubectl get pods --selector=job-name=pi --output=<span style="color: #4eee94;">jsonpath</span>={.items..metadata.name})
$ kubectl logs $<span style="color: #4eee94;">pods</span> -c pi
3.141592653589793238462643383279502...
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb24f894" class="outline-2">
<h2 id="orgb24f894">Bare Pods</h2>
<div class="outline-text-2" id="text-orgb24f894">
<p>
所谓Bare Pods是指直接用PodSpec来创建的Pod（即不在ReplicaSets或者ReplicationController的管理之下的Pods）
</p>

<pre class="example" id="org2df5b4f">
这些Pod在Node重启后不会自动重启，但Job则会创建新的Pod继续任务

所以，推荐使用Job来替代Bare Pods，即便是应用只需要一个Pod
</pre>

<p>
<a href="cronjob.html">Next: CronJob</a>
</p>

<p>
<a href="replica_set.html">Previous: ReplicaSet</a>
</p>

<p>
<a href="controller.html">Home：Controller</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
